---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData
source: html/48884c0e-99a0-f504-3c1a-6e6464627385.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ImportFailures.ATFContainedUnsupportedGeometricData Property

The original model contains unsupported geometric data such as curves or points.

## Syntax (C#)
```csharp
public static FailureDefinitionId ATFContainedUnsupportedGeometricData { get; }
```